Revit 2027 API
Family.IsUserCreated Property
 Determine whether the family has been defined by the user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUserCreated { get; }
Public ReadOnly Property IsUserCreated As Boolean
	Get
public:
property bool IsUserCreated {
	bool get ();
}
member IsUserCreated : bool with get
Property Value
Boolean
Remarks
 Some families are created internally and cannot be saved or reloaded. This function will return False for such internal families.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace